Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data=[4,8,15,16,23,42]
series=pd.Series(data)

In [3]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
l=[1,2,3,4,5,6,7,8,9,10]
ser=pd.Series(l)
print(ser)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:  Then, print the DataFrame.

In [8]:
my_dic={
    'Name':['Alice','Bob','claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}
data1=pd.DataFrame(my_dic)

In [9]:
data1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It can be thought of as a table, similar to a spreadsheet or a SQL table, where data is organized into rows and columns. Each column in a DataFrame can be of a different data type, such as integers, strings, floating-point numbers, etc. DataFrames offer powerful tools for data manipulation, analysis, and cleaning.

On the other hand, a Pandas Series is a one-dimensional labeled array. It can be seen as a single column of data with associated row labels or indices. Series are used to hold a sequence of data values and provide a label (index) for each value. They are often used to represent a single variable or feature.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head() and tail(): These functions allow you to view the first few or last few rows of the DataFrame, respectively.

describe(): This function provides summary statistics of the numerical columns in the DataFrame.

groupby(): Used to group data based on one or more columns and perform aggregation operations.

drop(): Allows you to remove rows or columns from the DataFrame.

apply(): Apply a function along an axis of the DataFrame.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

The Data Frames in gneral are mutable as we can perfrom various data manipulation tasks.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [10]:
name=pd.Series(['mayank','hardik','kunal'])
age=pd.Series([21,21,20])
dic={
    'Name': name,
    'Age': age
}
data2=pd.DataFrame(dic)

In [11]:
data2

     Name  Age
0  mayank   21
1  hardik   21
2   kunal   20